{
  "architectures": [
    "CustomEncoderDecoderModel"
  ],
  "decoder": {
    "_attn_implementation_autoset": true,
    "add_cross_attention": true,
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 128,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "is_decoder": true,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 5000,
    "model_type": "bert",
    "num_attention_heads": 2,
    "num_hidden_layers": 2,
    "position_embedding_type": "absolute",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 19
  },
  "decoder_start_token_id": 1,
  "encoder": {
    "_attn_implementation_autoset": true,
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 128,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 5000,
    "model_type": "bert",
    "num_attention_heads": 2,
    "num_hidden_layers": 2,
    "position_embedding_type": "absolute",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 19
  },
  "eos_token_id": 2,
  "is_encoder_decoder": true,
  "model_type": "encoder-decoder",
  "pad_token_id": 0,
  "torch_dtype": "float32",
  "transformers_version": "4.50.3",
  "vocab_size": 19
}
